Ran Plan for project: `dev` dir: `terraform/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.erouska.google_cloud_scheduler_job.sendwakeupsignal-worker will be created
+ resource "google_cloud_scheduler_job" "sendwakeupsignal-worker" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "sendwakeupsignal-worker"
      + project          = (known after apply)
      + region           = "europe-west1"
      + schedule         = "0 9 * * *"
      + time_zone        = "Europe/Prague"

      + http_target {
          + http_method = "GET"
          + uri         = "https://europe-west1-erouska-key-server-dev.cloudfunctions.net/SendWakeUpSignal"

          + oidc_token {
              + audience              = "https://europe-west1-erouska-key-server-dev.cloudfunctions.net/SendWakeUpSignal"
              + service_account_email = "sendwakeupsignal-invoker-sa@erouska-key-server-dev.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # module.erouska.google_project_iam_member.cloudbuild[0] will be created
+ resource "google_project_iam_member" "cloudbuild" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:382369682317@cloudbuild.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/cloudfunctions.developer"
    }

  # module.erouska.google_project_iam_member.sendwakeupsignal[1] must be replaced
-/+ resource "google_project_iam_member" "sendwakeupsignal" {
      ~ etag    = "BwW8LwsHreo=" -> (known after apply)
      ~ id      = "erouska-key-server-dev/roles/firebasenotifications.admin/serviceaccount:send-wakeup-signal@erouska-key-server-dev.iam.gserviceaccount.com" -> (known after apply)
        member  = "serviceAccount:send-wakeup-signal@erouska-key-server-dev.iam.gserviceaccount.com"
      ~ project = "erouska-key-server-dev" -> (known after apply)
      ~ role    = "roles/firebasenotifications.admin" -> "roles/secretmanager.secretAccessor" # forces replacement
    }

  # module.erouska.google_project_iam_member.sendwakeupsignal[2] will be created
+ resource "google_project_iam_member" "sendwakeupsignal" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:send-wakeup-signal@erouska-key-server-dev.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/firebasenotifications.admin"
    }

  # module.erouska.google_project_iam_member.sendwakeupsignal[3] will be created
+ resource "google_project_iam_member" "sendwakeupsignal" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:send-wakeup-signal@erouska-key-server-dev.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/firebase.growthAdmin"
    }

  # module.erouska.google_pubsub_topic.efgs-postponed-yesterdays-downloading will be created
+ resource "google_pubsub_topic" "efgs-postponed-yesterdays-downloading" {
      + id      = (known after apply)
      + name    = "efgs-postponed-yesterdays-downloading"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://34.77.35.141/lock?id=covid19cz%252Ferouska-backend%252Fterraform%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p dev`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
